data/database.dot
digraph ER {
    rankdir=LR
    node[shape=plain]
    
    ApiClients [label=<
        <table border="0" cellborder="1" cellspacing="0">
            <tr><td><i><b>ApiClients</b></i></td></tr>
            <tr>
                <td port="Id">&lt;&lt;PK&gt;&gt; Id (text)</td>
            </tr>
            <tr>
                <td port="Name">Name (character varying (30))</td>
            </tr>
            <tr>
                <td port="AllowedMethods">AllowedMethods (jsonb)</td>
            </tr>
            <tr>
                <td port="UseCount">UseCount (integer)</td>
            </tr>
            <tr>
                <td port="LastUse">LastUse (timestamp without time zone)</td>
            </tr>
        </table>
    >];
    
    AuditLogFiles [label=<
        <table border="0" cellborder="1" cellspacing="0">
            <tr><td><i><b>AuditLogFiles</b></i></td></tr>
            <tr>
                <td port="Id">&lt;&lt;PK&gt;&gt; Id (BIGINT)</td>
            </tr>
            <tr>
                <td port="AuditLogItemId">AuditLogItemId (BIGINT)</td>
            </tr>
            <tr>
                <td port="Filename">Filename (character varying (255))</td>
            </tr>
            <tr>
                <td port="Size">Size (BIGINT)</td>
            </tr>
        </table>
    >];
    
    AuditLogs [label=<
        <table border="0" cellborder="1" cellspacing="0">
            <tr><td><i><b>AuditLogs</b></i></td></tr>
            <tr>
                <td port="Id">&lt;&lt;PK&gt;&gt; Id (BIGINT)</td>
            </tr>
            <tr>
                <td port="CreatedAt">CreatedAt (timestamp without time zone)</td>
            </tr>
            <tr>
                <td port="GuildId">GuildId (character varying (30))</td>
            </tr>
            <tr>
                <td port="ProcessedUserId">ProcessedUserId (character varying (30))</td>
            </tr>
            <tr>
                <td port="DiscordAuditLogItemId">DiscordAuditLogItemId (text)</td>
            </tr>
            <tr>
                <td port="Data">Data (text)</td>
            </tr>
            <tr>
                <td port="Type">Type (integer)</td>
            </tr>
            <tr>
                <td port="ChannelId">ChannelId (character varying (30))</td>
            </tr>
        </table>
    >];
    
    AutoReplies [label=<
        <table border="0" cellborder="1" cellspacing="0">
            <tr><td><i><b>AutoReplies</b></i></td></tr>
            <tr>
                <td port="Id">&lt;&lt;PK&gt;&gt; Id (BIGINT)</td>
            </tr>
            <tr>
                <td port="Template">Template (text)</td>
            </tr>
            <tr>
                <td port="Reply">Reply (text)</td>
            </tr>
            <tr>
                <td port="Flags">Flags (bigint)</td>
            </tr>
        </table>
    >];
    
    Channels [label=<
        <table border="0" cellborder="1" cellspacing="0">
            <tr><td><i><b>Channels</b></i></td></tr>
            <tr>
                <td port="GuildId">&lt;&lt;PK&gt;&gt; GuildId (character varying (30))</td>
            </tr>
            <tr>
                <td port="ChannelId">&lt;&lt;PK&gt;&gt; ChannelId (character varying (30))</td>
            </tr>
            <tr>
                <td port="Name">Name (character varying (100))</td>
            </tr>
            <tr>
                <td port="ChannelType">ChannelType (integer)</td>
            </tr>
            <tr>
                <td port="ParentChannelId">ParentChannelId (character varying (30))</td>
            </tr>
            <tr>
                <td port="Flags">Flags (bigint)</td>
            </tr>
            <tr>
                <td port="RolePermissionsCount">RolePermissionsCount (integer)</td>
            </tr>
            <tr>
                <td port="UserPermissionsCount">UserPermissionsCount (integer)</td>
            </tr>
        </table>
    >];
    
    EmoteSuggestions [label=<
        <table border="0" cellborder="1" cellspacing="0">
            <tr><td><i><b>EmoteSuggestions</b></i></td></tr>
            <tr>
                <td port="Id">&lt;&lt;PK&gt;&gt; Id (BIGINT)</td>
            </tr>
            <tr>
                <td port="SuggestionMessageId">SuggestionMessageId (character varying (30))</td>
            </tr>
            <tr>
                <td port="VoteMessageId">VoteMessageId (character varying (30))</td>
            </tr>
            <tr>
                <td port="CreatedAt">CreatedAt (timestamp without timezone)</td>
            </tr>
            <tr>
                <td port="VoteEndsAt">VoteEndsAt (timestamp without timezone)</td>
            </tr>
            <tr>
                <td port="ImageData">ImageData (bytea)</td>
            </tr>
            <tr>
                <td port="GuildId">GuildId (character varying (30))</td>
            </tr>
            <tr>
                <td port="FromUserId">FromUserId (character varying (30))</td>
            </tr>
            <tr>
                <td port="Filename">Filename (character varying (255))</td>
            </tr>
            <tr>
                <td port="EmoteName">EmoteName (character varying (50))</td>
            </tr>
            <tr>
                <td port="Description">Description (character varying (1024))</td>
            </tr>
            <tr>
                <td port="ApprovedForVote">ApprovedForVote (boolean)</td>
            </tr>
            <tr>
                <td port="VoteFinished">VoteFinished (boolean)</td>
            </tr>
            <tr>
                <td port="CommunityApproved">CommunityApproved (boolean)</td>
            </tr>
            <tr>
                <td port="DownVotes">DownVotes (integer)</td>
            </tr>
            <tr>
                <td port="UpVotes">UpVotes (integer)</td>
            </tr>
        </table>
    >];
    
    Emotes [label=<
        <table border="0" cellborder="1" cellspacing="0">
            <tr><td><i><b>Emotes</b></i></td></tr>
            <tr>
                <td port="EmoteId">&lt;&lt;PK&gt;&gt; EmoteId (character varying (255))</td>
            </tr>
            <tr>
                <td port="UserId">&lt;&lt;PK&gt;&gt; UserId (character varying (30))</td>
            </tr>
            <tr>
                <td port="UseCount">UseCount (bigint)</td>
            </tr>
            <tr>
                <td port="FirstOccurenceAt">FirstOccurenceAt (timestamp without timezone)</td>
            </tr>
            <tr>
                <td port="LastOccurenceAt">LastOccurenceAt (timestamp without timezone)</td>
            </tr>
            <tr>
                <td port="GuildId">&lt;&lt;PK&gt;&gt; GuildId (character varying (30))</td>
            </tr>
        </table>
    >];
    
    GuildEvent [label=<
        <table border="0" cellborder="1" cellspacing="0">
            <tr><td><i><b>GuildEvent</b></i></td></tr>
            <tr>
                <td port="Id">&lt;&lt;PK&gt;&gt; Id (text)</td>
            </tr>
            <tr>
                <td port="GuildId">&lt;&lt;PK&gt;&gt; GuildId (character varying (30))</td>
            </tr>
            <tr>
                <td port="From">From (timestamp without timezone)</td>
            </tr>
            <tr>
                <td port="To">To (timestamp without timezone)</td>
            </tr>
        </table>
    >];
    
    GuildUsers [label=<
        <table border="0" cellborder="1" cellspacing="0">
            <tr><td><i><b>GuildUsers</b></i></td></tr>
            <tr>
                <td port="UserId">&lt;&lt;PK&gt;&gt; UserId (character varying (30))</td>
            </tr>
            <tr>
                <td port="GuildId">&lt;&lt;PK&gt;&gt; GuildId (character varying (30))</td>
            </tr>
            <tr>
                <td port="UsedInviteCode">UsedInviteCode (character varying (20))</td>
            </tr>
            <tr>
                <td port="GivenReactions">GivenReactions (bigint)</td>
            </tr>
            <tr>
                <td port="ObtainedReactions">ObtainedReactions (bigint)</td>
            </tr>
            <tr>
                <td port="LastPointsMessageIncrement">LastPointsMessageIncrement (timestamp without timezone)</td>
            </tr>
            <tr>
                <td port="LastPointsReactionIncrement">LastPointsReactionIncrement (timestamp without timezone)</td>
            </tr>
            <tr>
                <td port="Nickname">Nickname (character varying (32))</td>
            </tr>
        </table>
    >];
    
    Guilds [label=<
        <table border="0" cellborder="1" cellspacing="0">
            <tr><td><i><b>Guilds</b></i></td></tr>
            <tr>
                <td port="Id">&lt;&lt;PK&gt;&gt; Id (character varying (30))</td>
            </tr>
            <tr>
                <td port="Name">Name (character varying (100))</td>
            </tr>
            <tr>
                <td port="MuteRoleId">MuteRoleId (character varying (30))</td>
            </tr>
            <tr>
                <td port="AdminChannelId">AdminChannelId (character varying (30))</td>
            </tr>
            <tr>
                <td port="BoosterRoleId">BoosterRoleId (character varying (30))</td>
            </tr>
            <tr>
                <td port="EmoteSuggestionChannelId">EmoteSuggestionChannelId (character varying (30))</td>
            </tr>
            <tr>
                <td port="VoteChannelId">VoteChannelId (character varying (30))</td>
            </tr>
        </table>
    >];
    
    Invites [label=<
        <table border="0" cellborder="1" cellspacing="0">
            <tr><td><i><b>Invites</b></i></td></tr>
            <tr>
                <td port="Code">&lt;&lt;PK&gt;&gt; Code (character varying (10))</td>
            </tr>
            <tr>
                <td port="CreatedAt">CreatedAt (timestamp without time zone)</td>
            </tr>
            <tr>
                <td port="CreatorId">CreatorId (character varying (30))</td>
            </tr>
            <tr>
                <td port="GuildId">GuildId (character varying (30))</td>
            </tr>
        </table>
    >];
    
    Nicknames [label=<
        <table border="0" cellborder="1" cellspacing="0">
            <tr><td><i><b>Nicknames</b></i></td></tr>
            <tr>
                <td port="GuildId">&lt;&lt;PK&gt;&gt; GuildId (character varying (30))</td>
            </tr>
            <tr>
                <td port="UserId">&lt;&lt;PK&gt;&gt; UserId (character varying (30))</td>
            </tr>
            <tr>
                <td port="Id">Id (bigint)</td>
            </tr>
            <tr>
                <td port="NicknameValue">NicknameValue (character varying (32))</td>
            </tr>
        </table>
    >];
    
    Reminders [label=<
        <table border="0" cellborder="1" cellspacing="0">
            <tr><td><i><b>Reminders</b></i></td></tr>
            <tr>
                <td port="Id">&lt;&lt;PK&gt;&gt; Id (bigint)</td>
            </tr>
            <tr>
                <td port="FromUserId">FromUserId (character varying (30))</td>
            </tr>
            <tr>
                <td port="ToUserId">ToUserId (character varying (30))</td>
            </tr>
            <tr>
                <td port="At">At (timestamp without time zone)</td>
            </tr>
            <tr>
                <td port="Message">Message (text)</td>
            </tr>
            <tr>
                <td port="Postpone">Postpone (integer)</td>
            </tr>
            <tr>
                <td port="OriginalMessageId">OriginalMessageId (character varying (30))</td>
            </tr>
            <tr>
                <td port="RemindMessageId">RemindMessageId (character varying (30))</td>
            </tr>
        </table>
    >];
    
    SearchItems [label=<
        <table border="0" cellborder="1" cellspacing="0">
            <tr><td><i><b>SearchItems</b></i></td></tr>
            <tr>
                <td port="Id">&lt;&lt;PK&gt;&gt; Id (bigint)</td>
            </tr>
            <tr>
                <td port="UserId">UserId (character varying (30))</td>
            </tr>
            <tr>
                <td port="GuildId">GuildId (character varying (30))</td>
            </tr>
            <tr>
                <td port="ChannelId">ChannelId (character varying (30))</td>
            </tr>
            <tr>
                <td port="MessageContent">MessageContent (character varying (1024))</td>
            </tr>
        </table>
    >];
    
    SelfunverifyKeepables [label=<
        <table border="0" cellborder="1" cellspacing="0">
            <tr><td><i><b>SelfunverifyKeepables</b></i></td></tr>
            <tr>
                <td port="GroupName">&lt;&lt;PK&gt;&gt; GroupName (character varying (100))</td>
            </tr>
            <tr>
                <td port="Name">&lt;&lt;PK&gt;&gt; Name (character varying (100))</td>
            </tr>
        </table>
    >];
    
    Unverifies [label=<
        <table border="0" cellborder="1" cellspacing="0">
            <tr><td><i><b>Unverifies</b></i></td></tr>
            <tr>
                <td port="GuildId">&lt;&lt;PK&gt;&gt; GuildId (character varying (30))</td>
            </tr>
            <tr>
                <td port="UserId">&lt;&lt;PK&gt;&gt; UserId (character varying (30))</td>
            </tr>
            <tr>
                <td port="StartAt">StartAt (timestamp without time zone)</td>
            </tr>
            <tr>
                <td port="EndAt">EndAt (timestamp without time zone)</td>
            </tr>
            <tr>
                <td port="Reason">Reason (text)</td>
            </tr>
            <tr>
                <td port="Roles">Roles (jsonb)</td>
            </tr>
            <tr>
                <td port="Channels">Channels (jsonb)</td>
            </tr>
            <tr>
                <td port="SetOperationId">SetOperationId (bigint)</td>
            </tr>
        </table>
    >];
    
    UnverifyLogs [label=<
        <table border="0" cellborder="1" cellspacing="0">
            <tr><td><i><b>UnverifyLogs</b></i></td></tr>
            <tr>
                <td port="Id">&lt;&lt;PK&gt;&gt; Id (bigint)</td>
            </tr>
            <tr>
                <td port="Operation">Operation (integer)</td>
            </tr>
            <tr>
                <td port="GuildId">GuildId (character varying (30))</td>
            </tr>
            <tr>
                <td port="FromUserId">FromUserId (character varying (30))</td>
            </tr>
            <tr>
                <td port="ToUserId">ToUserId (character varying (30))</td>
            </tr>
            <tr>
                <td port="CreatedAt">CreatedAt (timestamp without time zone)</td>
            </tr>
            <tr>
                <td port="Data">Data (text)</td>
            </tr>
        </table>
    >];
    
    UserChannels [label=<
        <table border="0" cellborder="1" cellspacing="0">
            <tr><td><i><b>UserChannels</b></i></td></tr>
            <tr>
                <td port="ChannelId">&lt;&lt;PK&gt;&gt; ChannelId (character varying (30))</td>
            </tr>
            <tr>
                <td port="GuildId">&lt;&lt;PK&gt;&gt; GuildId (character varying (30))</td>
            </tr>
            <tr>
                <td port="UserId">&lt;&lt;PK&gt;&gt; UserId (character varying (30))</td>
            </tr>
            <tr>
                <td port="Count">Count (bigint)</td>
            </tr>
            <tr>
                <td port="FirstMessageAt">FirstMessageAt (timestamp without time zone)</td>
            </tr>
            <tr>
                <td port="LastMessageAt">LastMessageAt (timestamp without time zone)</td>
            </tr>
        </table>
    >];
    
    Users [label=<
        <table border="0" cellborder="1" cellspacing="0">
            <tr><td><i><b>Users</b></i></td></tr>
            <tr>
                <td port="Id">&lt;&lt;PK&gt;&gt; Id (character varying (30))</td>
            </tr>
            <tr>
                <td port="Flags">Flags (bigint)</td>
            </tr>
            <tr>
                <td port="Birthday">Birthday (timestamp without time zone)</td>
            </tr>
            <tr>
                <td port="Note">Note (text)</td>
            </tr>
            <tr>
                <td port="Username">Username (character varying (32))</td>
            </tr>
            <tr>
                <td port="SelfUnverifyMinimalTime">SelfUnverifyMinimalTime (text)</td>
            </tr>
            <tr>
                <td port="Discriminator">Discriminator (character varying (4))</td>
            </tr>
            <tr>
                <td port="Status">Status (integer)</td>
            </tr>
            <tr>
                <td port="Language">Language (character varying (50))</td>
            </tr>
        </table>
    >];
    
    GuildUsers:UserId -> Users:Id
    GuildUsers:GuildId -> Guilds:Id
    GuildUsers:UsedInviteCode -> Invites:Code
    
    Invites:CreatorId -> GuildUsers:UserId
    Invites:GuildId -> Guilds:Id
    
    Emotes:UserId -> GuildUsers:UserId
    Emotes:GuildId -> Guilds:Id
    
    Reminders:FromUserId -> Users:Id
    Reminders:ToUserId -> Users:Id
    
    UserChannels:GuildId -> Guilds:Id
    UserChannels:UserId -> GuildUsers:UserId
    UserChannels:ChannelId -> Channels:ChannelId
    
    Channels:GuildId -> Guilds:Id
    Channels:ParentChannelId -> Channels:ChannelId
    
    SearchItems:UserId -> Users:Id
    SearchItems:ChannelId -> Channels:ChannelId
    SearchItems:GuildId -> Guilds:Id
    
    Unverifies:UserId -> GuildUsers:UserId
    Unverifies:SetOperationId -> UnverifyLogs:Id
    Unverifies:GuildId -> Guilds:Id
    
    UnverifyLogs:FromUserId -> GuildUsers:UserId
    UnverifyLogs:ToUserId -> GuildUsers:UserId
    UnverifyLogs:GuildId -> Guilds:Id
    
    AuditLogs:GuildId -> Guilds:Id
    AuditLogs:ProcessedUserId -> GuildUsers:UserId
    AuditLogs:ProcessedUserId -> Users:Id
    AuditLogs:ChannelId -> Channels:ChannelId
    
    AuditLogFiles:AuditLogItemId -> AuditLogs:Id
    
    GuildEvent:GuildId -> Guilds:Id
    
    EmoteSuggestions:GuildId -> Guilds:Id
    EmoteSuggestions:FromUserId -> GuildUsers:UserId
    
    Nicknames:GuildId -> Guilds:Id
    Nicknames:UserId -> GuildUsers:UserId
}
